---
kind: method
id: M:Autodesk.Revit.DB.Architecture.BalusterPlacement.Dispose
source: html/78a4fa8a-d5fa-736c-8c98-05073e31a556.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPlacement.Dispose Method

Releases all resources used by the BalusterPlacement

## Syntax (C#)
```csharp
public void Dispose()
```